In [14]:
import sqlite3

#working with database using SQL(stuctured query language)

# create database

In [15]:
#student_database will be created in jupyter notebook home

db=sqlite3.connect("student_database.db")

cursor
a cursor in sql is a temporary work area created in system memory when sql statment is executed.
a sql cursor is a set of rows together with a pointer that identifies a cursor raw .
it is a database object to reterieve data from a result set one row at a time.

In [16]:
# create a cursor 

cur=db.cursor()

# Create table in student_database

In [17]:
cur.execute("create table student (id int primary key,name text,marks int)")

OperationalError: table student already exists

# insert data in student table

In [18]:
cur.execute("insert into student(id,name,marks) values(1,'john',90)")

In [23]:
db.commit;

In [24]:
print(cur.rowcount,"record(s) inserted")

-1 record(s) inserted

In [25]:
cur.execute("insert into student(id,name,marks) values(2,'teena',100)")

In [26]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)

In [27]:
cur.execute("insert into student(id,name,marks) values(3,'andrew',70)")

In [28]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)

In [29]:
cur.execute("insert into student(id,name,marks) values(4,'dorsey',56)")

In [30]:
cur.execute("insert into student(id,name,marks) values(5,'devid',46)")

In [31]:
cur.execute("insert into student(id,name,marks) values(6,'kim',88)")

In [32]:
results=cur.execute("select * from student")

In [33]:
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)

In [34]:
#insert multipal record
cur.execute("insert into student values(7,'kiara',75),(8,'jack',94)")

# Accessing data stored in SQLite using Python

In [35]:
results=cur.execute("select * from student")
 
    
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

In [23]:
results=cur.execute("select id,name from student")
for i in results:
    print(i)

(1, 'john')
(2, 'teena')
(3, 'andrew')
(4, 'dorsey')
(5, 'devid')
(6, 'kim')
(7, 'kiara')
(8, 'jack')

In [24]:
results=cur.execute("select id,marks from student")
for i in results:
    print(i)

(1, 90)
(2, 100)
(3, 70)
(4, 56)
(5, 46)
(6, 88)
(7, 75)
(8, 94)

In [25]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

In [26]:
results=cur.execute("select * from student where id=1")
for i in results:
    print(i)

(1, 'john', 90)

In [27]:
results=cur.execute("select * from student where id=2")
for i in results:
    print(i)

(2, 'teena', 100)

In [28]:
results=cur.execute("select * from student where id=5")
for i in results:
    print(i)

(5, 'devid', 46)

In [29]:
results=cur.execute("select * from student limit 3")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)

In [30]:
results=cur.execute("select * from student where id=1")

In [31]:
results.fetchone()

(1, 'john', 90)

In [32]:
results=cur.execute("select * from student where id=4")
for i in results:
    print(i)

(4, 'dorsey', 56)

In [33]:
results=cur.execute("select * from student where name='jack'")
results.fetchall()

[(8, 'jack', 94)]

In [34]:
results=cur.execute("select * from student where name='jack'")
for i in results:
    print(i)

(8, 'jack', 94)

In [35]:
results=cur.execute("select * from student where marks=92")
for i in results:
    print(i)

In [36]:
results=cur.execute("select id,marks from student")
for i in results:
    print(i)

(1, 90)
(2, 100)
(3, 70)
(4, 56)
(5, 46)
(6, 88)
(7, 75)
(8, 94)

In [37]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

In [43]:
results=cur.execute("select * from student where id=1")

In [44]:
results.fetchone()

(1, 'john', 90)

In [45]:
results=cur.execute("select * from student where id=4")
results.fetchone()

(4, 'dorsey', 56)

In [51]:
results=cur.execute("select * from student where name= 'jack'")

for i in results:
    print(i)

(8, 'jack', 94)

In [53]:
results=cur.execute("select * from student where marks=94")

for i in results:
    print(i)

(8, 'jack', 94)

In [54]:
results=cur.execute("select * from student where marks=88")

for i in results:
    print(i)

(6, 'kim', 88)

In [56]:
results=cur.execute("select * from student limit 3")

for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)

In [57]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

In [61]:
results=cur.execute("select * from student where id in (4,5,6) ")

for i in results:
    print(i)

(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)

In [62]:
results=cur.execute("select * from student where name in ('kim','andrew') ")

for i in results:
    print(i)

(3, 'andrew', 70)
(6, 'kim', 88)

In [63]:
results=cur.execute("select * from student where marks in (70,46) ")

for i in results:
    print(i)

(3, 'andrew', 70)
(5, 'devid', 46)

In [66]:
results=cur.execute("select * from student order by name asc")

for i in results:
    print(i)

(3, 'andrew', 70)
(5, 'devid', 46)
(4, 'dorsey', 56)
(8, 'jack', 94)
(1, 'john', 90)
(7, 'kiara', 75)
(6, 'kim', 88)
(2, 'teena', 100)

In [67]:
results=cur.execute("select * from student order by name desc")

for i in results:
    print(i)

(2, 'teena', 100)
(6, 'kim', 88)
(7, 'kiara', 75)
(1, 'john', 90)
(8, 'jack', 94)
(4, 'dorsey', 56)
(5, 'devid', 46)
(3, 'andrew', 70)

In [68]:
results=cur.execute("select * from student order by marks asc")

for i in results:
    print(i)

(5, 'devid', 46)
(4, 'dorsey', 56)
(3, 'andrew', 70)
(7, 'kiara', 75)
(6, 'kim', 88)
(1, 'john', 90)
(8, 'jack', 94)
(2, 'teena', 100)

In [69]:
results=cur.execute("select * from student order by marks asc limit 3")

for i in results:
    print(i)

(5, 'devid', 46)
(4, 'dorsey', 56)
(3, 'andrew', 70)

In [70]:
results=cur.execute("select * from student order by marks desc limit 3")

for i in results:
    print(i)

(2, 'teena', 100)
(8, 'jack', 94)
(1, 'john', 90)

In [71]:
results=cur.execute("select * from student order by name desc")

for i in results:
    print(i)

(2, 'teena', 100)
(6, 'kim', 88)
(7, 'kiara', 75)
(1, 'john', 90)
(8, 'jack', 94)
(4, 'dorsey', 56)
(5, 'devid', 46)
(3, 'andrew', 70)

In [72]:
results=cur.execute("select * from student where name='john'")

for i in results:
    print(i)

(1, 'john', 90)

In [74]:
results=cur.execute("select marks from student where name='john'")

for i in results:
    print(i)

(90,)

In [76]:
results=cur.execute("select * from student where marks>60 and marks<90")

for i in results:
    print(i)

(3, 'andrew', 70)
(6, 'kim', 88)
(7, 'kiara', 75)

In [77]:
results=cur.execute("select * from student where marks>40 and marks<60")

for i in results:
    print(i)

(4, 'dorsey', 56)
(5, 'devid', 46)

In [80]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

In [82]:
#fechall command will fectch all rows

results=cur.execute("select * from student")


results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (4, 'dorsey', 56),
 (5, 'devid', 46),
 (6, 'kim', 88),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

In [83]:
results=cur.execute("select * from student order by marks asc limit 3")
results.fetchall()

[(5, 'devid', 46), (4, 'dorsey', 56), (3, 'andrew', 70)]

In [84]:
results=cur.execute("select * from student order by name desc")
results.fetchall()

[(2, 'teena', 100),
 (6, 'kim', 88),
 (7, 'kiara', 75),
 (1, 'john', 90),
 (8, 'jack', 94),
 (4, 'dorsey', 56),
 (5, 'devid', 46),
 (3, 'andrew', 70)]

AND operator

In [88]:
results=cur.execute("select * from student where name='devid' and marks=46")

for i in results:
    print(i)

(5, 'devid', 46)

In [89]:
results=cur.execute("select * from student where name='devid' and marks=68")

for i in results:
    print(i)

In [91]:
results=cur.execute("select * from student where id=2 and marks=69")

for i in results:
    print(i)

OR operator

In [92]:
results=cur.execute("select * from student where id=2 or marks=70")

for i in results:
    print(i)

(2, 'teena', 100)
(3, 'andrew', 70)

In [93]:
results=cur.execute("select * from student where id=3 or marks=100")

for i in results:
    print(i)

(2, 'teena', 100)
(3, 'andrew', 70)

In [94]:
results=cur.execute("select * from student where id=3 or marks=100")

results.fetchall()

[(2, 'teena', 100), (3, 'andrew', 70)]

In [95]:
results=cur.execute("select * from student where id=2 or marks=70")

for i in results:
    print(i)

(2, 'teena', 100)
(3, 'andrew', 70)

aggregate function

MIN ---find minimum
MAX ---find maximum
AVG ---find average
SUM --- find sum
COUNT ---count the number of rows

In [96]:
# find the minimum marks

results=cur.execute("select min(marks) from student")

for i in results:
    print(i)

(46,)

In [97]:
results=cur.execute("select max(marks) from student")

results.fetchone()

(100,)

In [98]:
# find average marks
results=cur.execute("select avg(marks) from student")

results.fetchone()

(77.375,)

In [99]:
# find sum
results=cur.execute("select sum(marks) from student")

results.fetchone()

(619,)

In [100]:
results=cur.execute("select count(id) from student")

results.fetchone()

(8,)

In [101]:
results=cur.execute("select * from student where marks between 65 and 85")

for i in results:
    print(i)

(3, 'andrew', 70)
(7, 'kiara', 75)

In [102]:
results=cur.execute("select * from student where marks is null")

for i in results:
    print(i)

In [103]:
results=cur.execute("select * from student where marks is not null")

for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

LIKE operators

In [104]:
results=cur.execute("select * from student where name like 'd%'")

for i in results:
    print(i)

(4, 'dorsey', 56)
(5, 'devid', 46)

In [106]:
results=cur.execute("select * from student where name like 'j%'")

for i in results:
    print(i)

(1, 'john', 90)
(8, 'jack', 94)

In [107]:
results=cur.execute("select * from student where name like '_a%'")

for i in results:
    print(i)

(8, 'jack', 94)

In [109]:
results=cur.execute("select * from student where name like '%m'")

for i in results:
    print(i)

(6, 'kim', 88)

In [111]:
results=cur.execute("select * from student where name like '%e%'")

for i in results:
    print(i)

(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)

In [112]:
results=cur.execute("select * from student")

results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (4, 'dorsey', 56),
 (5, 'devid', 46),
 (6, 'kim', 88),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

In [113]:
# display only 4 letter charactor
results=cur.execute("select * from student where name like '____'")

for i in results:
    print(i)

(1, 'john', 90)
(8, 'jack', 94)

In [115]:
results=cur.execute("select * from student where marks NOT in (70)")

results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (4, 'dorsey', 56),
 (5, 'devid', 46),
 (6, 'kim', 88),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

In [116]:
results=cur.execute("select * from student where name NOT in ('kim')")

results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (4, 'dorsey', 56),
 (5, 'devid', 46),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

# UPDATE record

In [118]:
# update the rrocord

sql="update student set marks=56 where id=4"
cur.execute(sql)

In [119]:
results=cur.execute("select * from student where id=4")

for row in results:
    print(row)

(4, 'dorsey', 56)

In [121]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

# multipale record update


# sql="update student set marks=92 where id in(1,2)"
# cur.execute(sql)

In [122]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'devid', 46)
(6, 'kim', 88)
(7, 'kiara', 75)
(8, 'jack', 94)

In [12]:
#multipal record update using 'IN'
sql="UPDATE student SET marks=68 where id in (5,6)"
cur.execute(sql)

# verify if its updated
results = cur.execute("SELECT * FROM student")
for row in results:
    print(row)

NameError: name 'cur' is not defined

In [ ]:
# db.close()

# accessing data stored in SQLite using python and pandas

In [3]:
import pandas as pd
import sqlite3

In [4]:
con=sqlite3.connect("student_database.db")

In [5]:
df=pd.read_sql_query("select * from student",con)

In [6]:
df

Empty DataFrame
Columns: [id, name, marks]
Index: []

In [9]:
con.close()

# Delete any unwanted records

In [38]:
sql="delete from student where id=6"

cur.execute(sql)

In [39]:
results=cur.execute("select * from student")
results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (4, 'dorsey', 56),
 (5, 'devid', 46),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

In [41]:
sql="delete from student where id=4"

cur.execute(sql)

In [42]:
results=cur.execute("select * from student")
results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (5, 'devid', 46),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

# DROP table student

In [43]:
sql='drop table student'
results=cur.execute(sql)

In [44]:
results=cur.execute("select * from student")
results.fetchall()

OperationalError: no such table: student

In [45]:
db.close()